Revit 2027 API
AnnotationLabelParameterFormatting.GetParameterDefinition Method
 The definition of the parameter shown in the label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InternalDefinition GetParameterDefinition(
	Document document
)
Public Function GetParameterDefinition (
	document As Document
) As InternalDefinition
public:
InternalDefinition^ GetParameterDefinition(
	Document^ document
)
member GetParameterDefinition :
        document : Document -> InternalDefinition
Parameters
document Document
 The document which contains the label and parameter.
Return Value
InternalDefinition
 The definition of the parameter shown in the label.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnnotationLabelParameterFormatting Class
Autodesk.Revit.DB Namespace